### Grouping and aggregation are used because they help you summarize, understand, and analyze the data
* How many?

* What is the average?

* What is the total?

* What is the maximum/minimum?

* How do different groups compare?

**Grouping separates your dataset into categories.**
**Aggregation summarizes each category.**

In [2]:
import pandas as pd
df=pd.read_csv("Titanic-Dataset.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
# Average age of male vs female
df.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [4]:
# Survival rate by gender
df.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

### Group by 2 columns

In [5]:
# Survival rate of gender within each class:
df.groupby(['Pclass','Sex'])['Survived'].mean()

Pclass  Sex
1       female    0.968085
        male      0.368852
2       female    0.921053
        male      0.157407
3       female    0.500000
        male      0.135447
Name: Survived, dtype: float64

In [6]:
# Aerage age in each class according to gender
df.groupby(['Pclass','Sex'])['Age'].mean()

Pclass  Sex
1       female    34.611765
        male      41.281386
2       female    28.722973
        male      30.740707
3       female    21.750000
        male      26.507589
Name: Age, dtype: float64

### Named aggregations

In [7]:
df.groupby('Sex').agg(
    avg_age=('Age','mean'),
    survival_rate=('Survived','mean'),
    avg_fare=('Fare','mean')
)

          avg_age  survival_rate   avg_fare
Sex
female  27.915709       0.742038  44.479818
male    30.726645       0.188908  25.523893

In [8]:
df.groupby(['Pclass','Sex']).agg(
    avg_age=('Age','mean'),
    survival_rate=('Survived','mean'),
    avg_fare=('Fare','mean')
)

                 avg_age  survival_rate    avg_fare
Pclass Sex
1      female  34.611765       0.968085  106.125798
       male    41.281386       0.368852   67.226127
2      female  28.722973       0.921053   21.970121
       male    30.740707       0.157407   19.741782
3      female  21.750000       0.500000   16.118810
       male    26.507589       0.135447   12.661633

<br><br><br>

## Pivot Tables

In [9]:
# (Gender on rows, Class on columns)
df.pivot_table(
    values='Survived',
    index='Pclass',
    columns='Sex',
    aggfunc='mean'
)

Sex       female      male
Pclass
1       0.968085  0.368852
2       0.921053  0.157407
3       0.500000  0.135447

In [10]:
# Average fare by class and embark point
df.pivot_table(
    values='Fare',
    index='Pclass',
    columns='Embarked',
    aggfunc='mean'
)

Embarked           C          Q          S
Pclass
1         104.718529  90.000000  70.364862
2          25.358335  12.350000  20.327439
3          11.214083  11.183393  14.644083

In [18]:
# Count how many passengers per class per gender
df.pivot_table(
    values='PassengerId',
    index='Pclass',
    columns='Sex',
    aggfunc='count'
)

Sex     female  male
Pclass
1           94   122
2           76   108
3          144   347

In [21]:
# Fill missing values
df.pivot_table(
    values='Fare',
    index='Pclass',
    columns='Embarked',
    aggfunc='mean',
    fill_value=0
)

Embarked           C          Q          S
Pclass
1         104.718529  90.000000  70.364862
2          25.358335  12.350000  20.327439
3          11.214083  11.183393  14.644083